#include <iostream>

#include "lib/bst.h"

// Подумать над тем, чтобы в Iterator добавить поля Node и убрать саму Node
// Протестировать свои функции
// Написать тесты

int main() {
  // bst<int, InOrder, std::greater<int>> a, c;
  //   bst<int, InOrder> b = a;
  //   c = a;
  //   std::cout << b.max_size() << ' ' << c.size();
  return 0;
}