#include <iostream>

#include "lib/bst.h"

// Протестировать свои функции
// Написать тесты
// написать minimum и maximum
// подумать над swap
// подумать все ли варианты методов написаны
// сделать нормальный tag-dispathing 

int main() {
  // bst<int, InOrder, std::greater<int>> a, c;
  //   bst<int, InOrder> b = a;
  //   c = a;
  //   std::cout << b.max_size() << ' ' << c.size();
  return 0;
}